1391
ability
able
above
absolutely
abt
ac
accept
accessing
accessories
according
account
accurate
actually
add
addition
adjust
advice
advise
affordable
afterwards
again
against
ago
agree
ahead
air
alarm
almost
along
alot
already
although
always
amazing
amazon
amazone
amazonin
amazons
amount
android
angle
angles
annoying
another
answer
anyone
anything
anyway
apart
app
appear
apple
application
applications
applied
apply
appreciate
apps
area
around
arrived
ask
asked
aspect
asphalt
asus
atmos
attached
attract
attractive
audio
aug
authorized
automatic
automatically
available
avalable
average
away
awesome
awsm
awsome
background
backup
bad
bangalore
based
basic
batter
battery
bayyery
bcoz
beast
beat
beats
beautiful
become
becomes
been
before
being
believe
below
best
better
between
beware
beyond
big
bigger
biggest
birds
bit
black
blaster
bloatware
blue
bluetooth
blunder
blured
blurry
body
book
boot
bored
both
bottom
bought
box
brand
branded
brands
break
breaking
brightness
brilliant
bring
broiler
broke
broken
brought
browser
browsing
bt
bubble
bubbles
budget
bugs
build
built
bulky
burn
business
button
buttons
buy
buydont
buyers
buying
bx
bye
c
cable
call
called
caller
calling
calls
cam
came
camera
cameras
cannot
cant
card
cards
care
careful
carry
carrying
case
cases
cd
cdma
cell
cellphone
cellular
center
centers
centre
certainly
chance
change
charge
charged
charger
charges
charging
charm
chasing
cheap
cheaper
cheated
check
checked
chinese
choice
chrome
city
claim
claims
clarity
class
clear
clearity
clearly
click
clicked
clicking
close
cloudtail
color
colors
colour
colours
comapny
combination
comes
comfortable
coming
comments
common
communicate
compact
companies
company
comparable
compare
compared
complain
complaining
complaint
complaints
complete
completely
computer
concern
condition
conditions
configuration
configure
confused
connect
connected
connection
connectivity
cons
considering
contact
contacts
content
control
cool
coolpad
core
corning
cost
couldnt
couple
cousin
cover
crap
crashed
crossed
custom
customer
customers
cutting
d
dad
daily
damn
data
date
daylight
days
dead
deal
deals
decent
decision
default
defective
defects
definitely
degree
degrees
deliver
delivered
delivers
delivery
dell
denim
describe
description
design
designed
despite
device
devices
diaplay
did
didnt
died
difference
different
difficult
directly
disappoint
disappointed
disappointing
disappointment
discharge
disgusting
disk
display
dissatisfied
distorted
does
doesnt
doing
dolby
done
donot
dont
double
doubt
down
download
downloaded
downloading
downside
drain
draining
drains
drastic
drawback
drive
driver
drivers
drop
drops
dslr
dual
due
dull
duos
duplicate
during
dust
dvd
e
ear
earlier
earphones
earpiece
ease
easily
easy
edge
effect
either
else
email
empty
encountered
end
enjoying
enough
error
especially
essential
etc
eui
ever
every
everyone
everything
everytime
excellent
except
exceptionally
excited
expect
expectations
expected
expensive
experience
experienced
experiencing
external
extra
extraordinary
extremely
eye
fabulous
face
facebook
faced
facing
factor
factory
fails
fake
fall
falling
fan
fantastic
far
fast
faster
father
fault
faulty
feature
features
feb
feedback
feel
feels
felt
few
file
files
final
finally
find
fine
finei
finest
finger
fingerer
fingerprint
finish
fit
fits
five
fix
fixed
flagship
flash
flipcart
flipkart
fluidic
followed
fool
forget
found
frame
freaks
free
freezes
frequently
friend
friendly
friends
fro
front
full
fullhd
fully
function
functioning
functions
further
future
g
galaxy
gallery
game
games
gaming
gave
gb
general
generation
genuine
gets
getting
gg
ghz
gift
given
gives
giving
glass
goes
going
gold
good
goodies
google
gorgeous
gorilla
got
gps
grainy
grand
graphics
great
grip
grt
guard
gud
guess
guide
guru
guy
guys
had
half
hand
hands
handset
handy
hang
hanged
hanging
hangs
happy
hard
hardly
hardware
has
hate
havent
having
hd
hdd
hdmi
headache
headphones
hear
hearing
heat
heated
heating
heats
heavily
heavy
hell
help
helpful
helps
hence
here
hi
high
higher
highly
hold
home
honor
hope
hoping
horrible
hot
hotspot
hour
hours
house
however
hp
hrs
huawei
iball
idea
ie
ignore
ill
im
image
images
imagine
immediately
important
impressed
improve
improved
improvement
inbuilt
inch
inches
include
included
including
incoming
indeed
india
indicating
inr
inserted
inside
install
installation
installed
instead
interface
internal
internet
ios
ipad
iphone
ips
ir
iron
irritating
isnt
issue
issues
item
iti
itself
ive
j
job
junk
k
keep
keeping
keeps
kept
key
keyboard
keypad
killer
kind
know
kochi
lacks
lag
lagging
lags
lan
lap
laptop
laptopwindows
larger
last
lasted
lasting
lasts
latest
launched
lcd
le
least
led
left
lenovo
les
less
let
lets
letv
level
life
light
lightening
lighting
like
liked
limited
list
listen
lite
little
load
loaded
local
location
lock
lodged
logitech
lollipop
long
looked
looking
looks
lot
lots
loud
love
loved
lovers
loving
low
lower
lte
lumia
m
machine
made
mah
main
mainly
major
make
makes
making
man
management
manner
manual
manufacturer
manufacturing
many
mark
market
masterpiece
max
may
maybe
mb
mean
means
mega
memory
mentioned
menu
message
metal
mgp
mi
mic
micro
micromax
microsoft
might
mii
mike
min
mind
minor
mins
minute
minutes
miss
missing
mistake
miui
mobile
mobiles
mode
model
models
modes
moments
money
month
months
more
moreover
morning
motherboard
moto
motorola
mouse
move
movies
mp
much
multi
multiple
multitasking
music
must
n
name
navigation
nd
near
nearby
nearly
need
needs
negative
net
netbook
network
networking
never
new
next
nice
nicely
night
no
noise
noisy
nokia
non
none
nonsense
nor
normal
not
note
notebook
notebooks
nothing
noticed
notification
nov
nt
number
observations
occur
octa
off
offer
offered
offers
office
often
oil
ok
okay
old
once
oneplus
ones
online
open
opened
opening
operate
operating
operation
option
options
order
ordered
original
os
ota
otg
others
otherwise
outdoor
output
outside
outstanding
overall
overheating
own
p
pack
package
packaging
packed
packing
pad
paid
painful
paisa
panel
panoramic
part
particularly
parts
party
past
pathetic
pay
paying
pc
penny
people
per
percent
perfect
perfectly
performance
period
person
phab
phablet
phone
phones
phonevery
photo
photos
pic
pick
pics
picture
pictures
piece
pieces
pin
pixel
place
plan
planning
plastic
play
played
player
playing
plays
please
pls
plugged
plus
plz
pm
pocket
point
points
policy
poor
port
positive
possible
power
powerful
ppl
predictive
preinstalled
preloaded
premium
present
pretty
price
priced
prices
primarily
primary
prime
print
probably
problem
problems
process
processing
processor
product
products
professional
promised
proper
properly
pros
provide
provided
provides
providing
pucrchage
purchase
purchased
purchasing
purpose
put
quality
quick
quickly
quite
r
racing
ram
range
rated
rather
rating
rbg
rd
reaches
read
reading
real
realize
realized
really
rear
reason
reasons
receive
received
recommend
recommended
recording
red
redmi
refund
regarding
register
regular
rejected
related
remove
repair
replace
replaced
replacement
replacing
replied
reply
request
required
requirement
reset
resolution
resolve
resolved
respond
responding
response
responsive
rest
restart
restarting
retail
return
returned
returning
revert
review
reviews
rich
right
ringing
ringtone
rom
rs
run
running
s
sad
said
sale
same
samsung
sar
satisfaction
satisfactory
satisfied
satisfy
satisfying
save
saved
saw
saying
scanner
scratch
scratches
screen
screens
sd
seal
search
searching
second
secondly
seconds
security
seem
seemed
seems
seen
segment
selected
selfie
selfies
sell
seller
selling
sense
sensitivity
sensor
sent
sep
serious
seriously
serve
service
serviced
set
setting
settings
sharp
shop
short
shortly
shots
should
shouldnt
show
showing
shown
showroom
shows
side
signal
sim
similar
simple
simply
since
single
sir
site
size
skin
skype
sleek
slider
slightly
slim
slip
slot
slots
slow
small
smart
smartphone
smartphones
smooth
smoothly
snapdragon
social
software
solution
solve
someone
something
sometimes
sony
soon
sorry
sound
space
spanish
speaker
speakers
speaking
specific
specification
specifications
specs
speech
speed
spend
spending
spoken
st
stable
standard
star
stars
starsdont
starslooks
start
started
starts
state
stay
stick
still
stock
stop
stopped
stops
storage
store
strongly
stuck
sturdy
stylish
such
suck
sucks
sudden
suddenly
sufficient
suggest
suggested
suggestion
suitable
suits
super
superb
superior
support
supported
supports
sure
surely
surface
surprised
switch
switched
switching
synching
system
tab
table
tablet
tabs
tag
take
taken
takes
taking
talk
talking
tampered
tap
tasking
team
tech
technical
tell
temperature
tempered
ten
terms
terrible
test
text
th
thank
thanks
thats
theres
thin
thing
things
third
thn
thoroughly
those
though
thought
three
thrice
through
tht
till
time
times
today
told
tone
too
took
tooth
top
total
totally
touch
touchpad
touchscreen
toy
transfer
tried
tries
true
truly
trust
try
trying
tuch
turn
turned
turning
tv
tweaks
twice
type
u
ui
under
understand
unfortunately
unit
unlike
unsatisfied
until
update
updated
updates
updating
upgrade
upgrading
upper
upto
ur
usage
usb
used
useful
useless
user
users
using
usual
v
value
verdict
verified
version
very
via
vibe
video
videos
viewing
visited
voice
volume
vr
wait
waiting
wake
wala
wanna
wanted
warm
warning
warranty
waste
wasted
watching
weak
website
week
weeks
weight
weird
went
were
whatsapp
where
whether
while
white
whole
whom
why
wide
wider
wife
wifi
win
window
windows
wise
wish
wit
within
without
wlan
wont
word
words
worked
working
works
world
worst
worth
worthy
wow
writing
written
wrong
wrote
x
xiaomi
y
years
yes
yesterday
yet
youll
youre
youtube
zenfone
zero
zoom
